/*
						-== № 1 ==-
 -== вывести количество инструкторов по каждой секции ==-
*/
--===============================================================================
-- Выводим кол-во работников по каждой стране
select Country, count(Country) from Employees group by Country order by Country;
-- 4 работника в Объединенном королевстве
-- 5 работников в США
-- Выводим кол-во клиентов по каждой стране
select Country, count(Country) from Customers group by Country order by Country;
--===============================================================================
/*
						-== № 2 ==-
 -== показать количество людей, которые должны заниматься ==-
 -==    в определенный момент времени в каждой секции	  ==-
*/
--===============================================================================
-- Выводим кол-во грузов, отправленых с 96 по 97 год в каждую страну
select ShipCountry, count(Freight) as FreightCount from 
(Select * from Orders where year(OrderDate) between 1996 and 1997) v
Group by v.ShipCountry order by v.ShipCountry;
--===============================================================================
/*
						-== № 3 ==-
 -== вывести количество посетителей фитнес клуба, которые	==-
 -== пользуются услугами определенного мобильного оператора	==-
*/
--===============================================================================
-- Выводим кол-во клиентов, которые пользуются услугами 
-- мобильного оператора, начинающегося с (171)

select count(Phone) as CustCount from
Customers where Phone LIKE '(171)%';
--===============================================================================
/*
						-== № 4 ==-
 -== получить количество посетителей, у которых фамилия ==-
 -==   совпадает с фамилиями из определенного списка	==-
*/
--===============================================================================
-- Получим Кол-во клиентов с определенными фамилиями
-- Для начала узнаем фамилии клиентов
select c.ContactName  from Customers c;
-- у них нет столбца с фамилиями!
-- Значит узнаем фамилии работников
select e.LastName from Employees e;
-- Фамилии: Buchanan, Callahan, Davolio, Dodsworth, Fuller, King, Leverling, Peacock, Suyama
select count(EmployeeID)
from Employees where LastName 
in ('Buchanan','Davolio','Dodsworth','Suyama')
--===============================================================================
/*
						-== № 5 ==-
 -== показать количество людей с одинаковыми именами,	==-
 -==   которые занимаются у определенного инструктора   ==-
*/
--===============================================================================
-- Здесь нет людей, с одинаковыми именами,
-- поэтому покажем сколько раз, каждый из сотрудников
-- отправил груз в Объединенное Королевство
select FirstName , count(ShipCountry) as 'OrderCount'
from Orders o, Employees e
where o.EmployeeID=e.EmployeeID and ShipCountry='UK'
group by FirstName
order by OrderCount;
--===============================================================================
/*
						-== № 6 ==-
 --== получить информацию о людях, которые посетили		==-
 -==     фитнес зал минимальное количество раз			==-
*/
--===============================================================================
-- Узнаем чувака, который меньше всех отправил заказов
-- (самый не эффективный работник)
-- Для начала узнаем, сколько каждый работник 
-- всего отправил з-зов
select FirstName, count(ShipCountry) as 'CountCountry' 
from Orders o, Employees e 
where o.EmployeeID=e.EmployeeID group by FirstName;

-- теперь выведем самый маленький показатель
select min(CountCountry) from
(select FirstName, count(ShipCountry) as 'CountCountry' 
from Orders o, Employees e 
where o.EmployeeID=e.EmployeeID group by FirstName) v;

-- Теперь из всего этого составим запрос на вывод
-- из двух таблиц имени и фамилии самого слабого работника
select LastName, FirstName,
count(ShipCountry) as 'CountOrder'
from Orders o, Employees e
where o.EmployeeID=e.EmployeeID 
group by LastName, FirstName 
having count(ShipCountry)=
(select min(CountCountry) from 
(select FirstName, count(ShipCountry) as 'CountCountry' 
from Orders o, Employees e 
where o.EmployeeID=e.EmployeeID group by FirstName) v) 
--===============================================================================
/*
						-== № 7 ==-
 -== вывести количество посетителей, которые занимались		==-
 -== в определенной секции за первую половину текущего года	==-
*/
--===============================================================================
-- Узнаем кол-во заказов за период
-- с 1996-07 по 1997-01
select count(*) from Orders
where ShippedDate between '1996-07-01' and '1997-01-01';
-- 144 заказа
--===============================================================================
/*
						-== № 8 ==-
 -== определить общее количество людей, посетивших		==-
 -==           фитнес зал за прошлый год				==-
*/
--===============================================================================
-- Прошлого года нет, поэтому узнаем кол-во з-зов за 1998 год
select count(*) from Orders
where year(ShippedDate) = 1998;
-- 268 з-зов
--===============================================================================