--=============================================================
--=============================================================
-- 1. Отделения (Departments)
CREATE TABLE Departments(
--=============================================================
-- Идентификатор (Id). Уникальный идентификатор отделения.
[Id] INT NOT NULL PRIMARY KEY IDENTITY(1,1),
/*
▷▷Тип данных — int.
▷▷Авто приращение.
▷▷Не может содержать null-значения.
▷▷Первичный ключ.
*/
--==============================================================
-- Корпус (Building). Номер корпуса, в котором 
-- располагается отделение:
[Building] INT NOT NULL CHECK([Building] BETWEEN 1 AND 5),
/*
▷▷Тип данных — int.
▷▷Не может содержать null-значения.
▷▷Должно быть в диапазоне от 1 до 5.
*/
--===============================================================
-- Финансирование (Financing). Фонд финансирования отделения.
[Financing] MONEY NOT NULL CHECK([Financing]>= 0.0) DEFAULT 0.0,
/*
▷▷Тип данных — money.
▷▷Не может содержать null-значения.
▷▷Не может быть меньше 0.
▷▷Значение по умолчанию — 0.
*/
--=================================================================
-- Этаж (Floor). Номер этажа, на котором располагается
-- отделение.
[Floor] INT NOT NULL CHECK([Floor] >= 1),
/*
▷▷Тип данных — int.
▷▷Не может содержать null-значения.
▷▷Не может быть меньше 1.
*/
--=================================================================
-- Название (Name). Название отделения.
[Name] NVARCHAR(100) NOT NULL UNIQUE CHECK([Name] <> N''),
/*
▷▷Тип данных — nvarchar(100).
▷▷Не может содержать null-значения.
▷▷Не может быть пустым.
▷▷Должно быть уникальным.
*/
);
--=================================================================
--=================================================================

-- 2. Заболевания (Diseases)
CREATE TABLE Diseases(
--=================================================================
-- Идентификатор (Id). Уникальный идентификатор заболевания.
[Id] INT IDENTITY(1,1) NOT NULL PRIMARY KEY,
/*
▷▷Тип данных — int.
▷▷Авто приращение.
▷▷Не может содержать null-значения.
▷▷Первичный ключ.
*/
--=================================================================
-- Название (Name). Название заболевания.
[Name] NVARCHAR(100) NOT NULL CHECK([Name] <> N'') UNIQUE,
/*
▷▷Тип данных — nvarchar(100).
▷▷Не может содержать null-значения.
▷▷Не может быть пустым.
▷▷Должно быть уникальным.
*/
--=================================================================
-- Степень тяжести (Severity). Степень тяжести заболевания.
[Severity] INT NOT NULL CHECK([Severity] >= 1) DEFAULT 1,
/*
▷▷Тип данных — int.
▷▷Не может содержать null-значения.
▷▷Не может быть меньше 1.
▷▷Значение по умолчанию — 1.
*/
);
--=================================================================
--=================================================================


-- 3. Врачи (Doctors)
CREATE TABLE Doctors(
--=================================================================
-- Идентификатор (Id). Уникальный идентификатор врача.
[Id] INT IDENTITY(1,1) NOT NULL PRIMARY KEY,
/*
▷▷Тип данных — int.
▷▷Авто приращение.
▷▷Не может содержать null-значения.
▷▷Первичный ключ.
*/
--=================================================================
-- Имя (Name). Имя врача
[Name] nvarchar(max) NOT NULL CHECK([Name] <> N''),
/*
▷▷Тип данных — nvarchar(max).
▷▷Не может содержать null-значения.
▷▷Не может быть пустым.
*/
--=================================================================
-- Телефон (Phone). Телефонный номер врача
[Phone] CHAR(17) NULL,
/*
▷▷Тип данных — char(10).
▷▷Может содержать null-значения.
*/
--=================================================================
-- Надбавка (Premium). Надбавка врача.
[Premium] MONEY NOT NULL CHECK([Premium] >= 0.0) DEFAULT 0.0,
/*
▷▷Тип данных — money.
▷▷Не может содержать null-значения.
▷▷Не может быть меньше 0.
▷▷Значение по умолчанию — 0.
*/
--=================================================================
-- Ставка (Salary). Ставка врача.
[Salary] MONEY NOT NULL CHECK([Salary] > 0.0),
/*
▷▷Тип данных — money.
▷▷Не может содержать null-значения.
▷▷Не может быть меньше либо равно 0.
*/
--=================================================================
-- Фамилия (Surname). Фамилия врача.
[Surname] NVARCHAR(max) NOT NULL CHECK([Surname] <> N'')
/*
▷▷Тип данных — nvarchar(max).
▷▷Не может содержать null-значения.
▷▷Не может быть пустым.
*/
);
--=================================================================
--=================================================================


-- 4. Обследования (Examinations)
CREATE TABLE Examinations(
--=================================================================
-- Идентификатор (Id). Уникальный идентификатор обследования.
[Id] INT IDENTITY(1,1) NOT NULL PRIMARY KEY,
/*
▷▷Тип данных — int.
▷▷Авто приращение.
▷▷Не может содержать null-значения.
▷▷Первичный ключ.
*/
--=================================================================
-- День недели (DayOfWeek). День недели, в который проводится
-- обследование.
[DayOfWeek] INT NOT NULL CHECK([DayOfWeek] BETWEEN 1 AND 7),
/*
▷▷Тип данных — int.
▷▷Не может содержать null-значения.
▷▷Должно быть в диапазоне от 1 до 7.
*/
--=================================================================
-- Время завершения (EndTime). Время завершения обследования.
[EndTime] TIME NOT NULL,
/*
▷▷Тип данных — time.
▷▷Не может содержать null-значения.
▷▷Должно быть больше времени начала обследования.
*/
--=================================================================
-- Название (Name). Название обследования.
[Name] NVARCHAR(100) NOT NULL CHECK([Name] <> N'') UNIQUE,
/*
▷▷Тип данных — nvarchar(100).
▷▷Не может содержать null-значения.
▷▷Не может быть пустым.
▷▷Должно быть уникальным.
*/
--=================================================================
-- Время начала (StartTime). Время начала обследования.
[StartTime] TIME NOT NULL CHECK([StartTime] BETWEEN '8.00' AND '18.00'),
/*
▷▷Тип данных — time.
▷▷Не может содержать null-значения.
▷▷Должно быть в диапазоне от 8:00 до 18:00.
*/
CHECK([StartTime] < [EndTime])
)
--=================================================================
--=================================================================


-- 5. Палаты (Wards)
CREATE TABLE Wards(
-- Идентификатор (Id). Уникальный идентификатор палаты.
[Id] INT IDENTITY(1,1) NOT NULL PRIMARY KEY,
/*
▷▷Тип данных — int.
▷▷Авто приращение.
▷▷Не может содержать null-значения.
▷▷Первичный ключ.
*/
--=================================================================
-- Корпус (Building). Номер корпуса, в котором располагается
-- палата.
[Building] INT NOT NULL CHECK([Building] BETWEEN 1 AND 5),
/*
▷▷Тип данных — int.
▷▷Не может содержать null-значения.
▷▷Должно быть в диапазоне от 1 до 5.
*/
--=================================================================
-- Этаж (Floor). Номер этажа, на котором располагается
-- палата.
[Floor] INT NOT NULL CHECK([Floor] >= 1),
/*
▷▷Тип данных — int.
▷▷Не может содержать null-значения.
▷▷Не может быть меньше 1.
*/
--=================================================================
-- Название (Name). Название палаты.
[Name] NVARCHAR(20) NOT NULL CHECK([Name] <> N'') UNIQUE
/*
▷▷Тип данных — nvarchar(20).
▷▷Не может содержать null-значения.
▷▷Не может быть пустым.
▷▷Должно быть уникальным.
*/
);
--=================================================================
--=================================================================


-- 6. Patients (Пациенты)
create table Patients(
-- Идентификатор (Id). Уникальный идентификатор пациента.
[Id] INT IDENTITY(1,1) NOT NULL PRIMARY KEY,
/*
▷▷Тип данных — int.
▷▷Авто приращение.
▷▷Не может содержать null-значения.
▷▷Первичный ключ.
*/
--=================================================================
-- Имя (FirstName). Имя пациента
[FirstName] nvarchar(30) not null CHECK([FirstName] <> N''),
/*
▷▷Тип данных — nvarchar(30).
▷▷Не может содержать null-значения.
▷▷Не может быть пустым.
*/
--=================================================================
-- Фамилия (LastName). Фамилия пациента
[LastName] nvarchar(30) not null CHECK ([LastName] <> N''),
/*
▷▷Тип данных — nvarchar(30).
▷▷Не может содержать null-значения.
▷▷Не может быть пустым.
*/
--=================================================================
-- Дата рождения (DateOfBirth). Дата рождения пациента
[DateOfBirth] date not null,
/*
▷▷Тип данных - date
▷▷Не может быть пустым
▷▷Не может содержать null-значения
*/
--=================================================================
-- Дата поступления (ReceiptDate). 
[ReceiptDate] date default getdate(),
/*
▷▷Тип данных - date
▷▷По умолчанию текущая дата
*/
--=================================================================
-- Дата выписки (DischargeDate).
[DischargeDate] date default getdate(),
/*
▷▷Тип данных - date
▷▷По умолчанию текущая дата
*/

-- Телефон (Phone). Телефонный номер пациента
[Phone] CHAR(17) NULL unique,
/*
▷▷Тип данных — char(10).
▷▷Может содержать null-значения.
*/
--=================================================================
);
